Repository: moqsb/SilentStore
Catalog: SilentStore/*.lproj/Localizable.strings
Languages: ar

source: Sort
ar: الترتيب

source: Folders
ar: المجلدات

source: All
ar: الكل

source: With Files
ar: بملفات

source: Empty
ar: فارغة

source: Select Items
ar: تحديد العناصر

source: Done Selecting
ar: إنهاء التحديد

source: Delete
ar: حذف

source: Share
ar: مشاركة

source: Info
ar: معلومات

source: AI Suggestions
ar: اقتراحات الذكاء الاصطناعي

source: Important Files
ar: ملفات مهمة

source: Duplicate Files
ar: ملفات مكررة

source: Large Files
ar: ملفات كبيرة

source: Unorganized Files
ar: ملفات غير منظمة

source: Recent Important
ar: مهمة حديثة

source: Files you open frequently
ar: ملفات تفتحها بشكل متكرر

source: Files that appear multiple times
ar: ملفات تظهر عدة مرات

source: Files taking up significant space
ar: ملفات تشغل مساحة كبيرة

source: Files without category or folder
ar: ملفات بدون فئة أو مجلد

source: Recently added important files
ar: ملفات مهمة تمت إضافتها مؤخراً

source: Today
ar: اليوم

source: This Week
ar: هذا الأسبوع

source: This Month
ar: هذا الشهر

source: No items today
ar: لا توجد عناصر اليوم

source: No items this week
ar: لا توجد عناصر هذا الأسبوع

source: No items this month
ar: لا توجد عناصر هذا الشهر

source: No files were opened today.
ar: لم يتم فتح أي ملفات اليوم.

source: No files were opened this week.
ar: لم يتم فتح أي ملفات هذا الأسبوع.

source: No files were opened this month.
ar: لم يتم فتح أي ملفات هذا الشهر.

source: AI Insights
ar: رؤى الذكاء الاصطناعي

source: files
ar: ملفات

source: free of
ar: متاح من

source: copies
ar: نسخ

source: Clean
ar: تنظيف

source: Your Vault Insights
ar: رؤى مخزنك

source: Most Opened Files
ar: الملفات الأكثر فتحاً

source: files you open frequently
ar: ملفات تفتحها بشكل متكرر

source: Last Opened
ar: آخر ملف تم فتحه

source: Cleanup Recommendations
ar: توصيات التنظيف

source: Chat with AI
ar: التحدث مع الذكاء الاصطناعي

source: Enable AI in Settings
ar: فعّل الذكاء الاصطناعي في الإعدادات

source: Turn on Local AI to chat and get insights
ar: فعّل الذكاء الاصطناعي المحلي للدردشة والحصول على الرؤى

source: Ask AI about your files...
ar: اسأل الذكاء الاصطناعي عن ملفاتك...

source: AI is thinking...
ar: الذكاء الاصطناعي يفكر...

source: Hello! I'm your AI assistant. I can help you: • Find your most opened files • Analyze your storage usage • Suggest cleanup opportunities • Answer questions about your files What would you like to know?
ar: مرحباً! أنا مساعدك الذكي. يمكنني مساعدتك في: • العثور على ملفاتك الأكثر فتحاً • تحليل استخدام التخزين • اقتراح فرص التنظيف • الإجابة على أسئلتك حول ملفاتك ماذا تريد أن تعرف؟

source: AI is currently disabled. Enable it in Settings to chat and get insights about your files.
ar: الذكاء الاصطناعي معطّل حالياً. فعّله في الإعدادات للدردشة والحصول على رؤى حول ملفاتك.

source: Your most opened files:
ar: ملفاتك الأكثر فتحاً:

source: times
ar: مرات

source: Your last opened file is: %@ Opened %@
ar: آخر ملف فتحته هو: %@ تم فتحه %@

source: Storage Analysis: • Total: %@
ar: تحليل التخزين: • الإجمالي: %@

source: %d duplicate groups found
ar: تم العثور على %d مجموعة مكررة

source: Large files (>50MB):
ar: ملفات كبيرة (>50 ميجابايت):

source: Your vault is well organized! 🎉
ar: مخزنك منظم بشكل جيد! 🎉

source: Consider cleaning duplicates and large files to save space.
ar: فكر في تنظيف الملفات المكررة والكبيرة لتوفير المساحة.

source: Here are my suggestions:
ar: إليك اقتراحاتي:

source: I can help you with: • Finding your most opened files • Analyzing storage usage • Suggesting cleanup opportunities • Answering questions about your files Try asking: 'What are my most opened files?' or 'How can I save space?'
ar: يمكنني مساعدتك في: • العثور على ملفاتك الأكثر فتحاً • تحليل استخدام التخزين • اقتراح فرص التنظيف • الإجابة على أسئلتك حول ملفاتك جرب السؤال: 'ما هي ملفاتي الأكثر فتحاً؟' أو 'كيف يمكنني توفير المساحة؟'

source: %d Duplicate Groups
ar: %d مجموعة مكررة

source: %d Large Files
ar: %d ملف كبير

source: Save %@ by removing duplicates
ar: وفر %@ بإزالة المكررات

source: Total size: %@
ar: الحجم الإجمالي: %@

source: View
ar: عرض

source: Pin
ar: تثبيت

source: Unpin
ar: إلغاء التثبيت

source: No files yet
ar: لا توجد ملفات بعد

source: Move to Folder
ar: نقل إلى مجلد

source: Unlock
ar: فتح

source: Create
ar: إنشاء

source: Cancel
ar: إلغاء

source: Create a new folder in your vault.
ar: أنشئ مجلدًا جديدًا في المخزن.

source: Select
ar: اختيار

source: Move
ar: نقل

source: Files
ar: الملفات

source: New Folder
ar: مجلد جديد

source: New Subfolder
ar: مجلد فرعي جديد

source: Folder name
ar: اسم المجلد

source: Create a subfolder inside %@
ar: أنشئ مجلدًا فرعيًا داخل %@

source: Move to Root
ar: نقل إلى الجذر

source: Move Folder
ar: نقل المجلد

source: Unable to load file.
ar: تعذر تحميل الملف.

source: Delete file?
ar: حذف الملف؟

source: Preview not available
ar: المعاينة غير متاحة

source: Storage
ar: التخزين

source: Device Storage
ar: تخزين الجهاز

source: Vault
ar: المخزن

source: Breakdown
ar: التفصيل

source: By file type
ar: حسب نوع الملف

source: Top Folders
ar: أكبر المجلدات

source: No folders yet
ar: لا توجد مجلدات بعد

source: Largest by size
ar: الأكبر حجمًا

source: Import files to see folder stats.
ar: استورد ملفات لعرض إحصاءات المجلدات.

source: Duplicates
ar: التكرارات

source: No duplicates found
ar: لا توجد تكرارات

source: All clear.
ar: كل شيء سليم.

source: Clean extras
ar: حذف الزائد

source: %.2f%% of device storage
ar: %.2f%% من تخزين الجهاز

source: Security
ar: الأمان

source: Use Face ID / Touch ID
ar: استخدام Face ID / Touch ID

source: Enable Local AI
ar: تفعيل الذكاء المحلي

source: Create Recovery Key
ar: إنشاء مفتاح استرداد

source: Recover with Key
ar: استرداد بالمفتاح

source: Reminders
ar: التذكيرات

source: Weekly Reminder
ar: تذكير أسبوعي

source: Reminder Time
ar: وقت التذكير

source: Weekday
ar: اليوم

source: Sunday
ar: الأحد

source: Monday
ar: الاثنين

source: Tuesday
ar: الثلاثاء

source: Wednesday
ar: الأربعاء

source: Thursday
ar: الخميس

source: Friday
ar: الجمعة

source: Saturday
ar: السبت

source: Storage Dashboard
ar: لوحة التخزين

source: Privacy Policy
ar: سياسة الخصوصية

source: Settings
ar: الإعدادات

source: Recovery Key
ar: مفتاح الاسترداد

source: Save this key in a safe place. It will only be shown once.
ar: احفظ هذا المفتاح في مكان آمن. سيُعرض مرة واحدة فقط.

source: Generate
ar: إنشاء

source: Done
ar: تم

source: Enter Recovery Key
ar: إدخال مفتاح الاسترداد

source: Base64 key
ar: مفتاح Base64

source: Recover
ar: استرداد

source: Recovery successful.
ar: تم الاسترداد بنجاح.

source: Recovery failed. Check the key.
ar: فشل الاسترداد. تحقق من المفتاح.

source: Welcome to SilentStore
ar: مرحبًا بك في SilentStore

source: We need a few permissions to help you import and protect your files.
ar: نحتاج بعض الأذونات لمساعدتك على الاستيراد وحماية ملفاتك.

source: Allow
ar: سماح

source: Skip
ar: تخطي

source: File
ar: ملف

source: Encryption
ar: التشفير

source: Key Storage
ar: تخزين المفتاح

source: File Info
ar: معلومات الملف

source: Name
ar: الاسم

source: Type
ar: النوع

source: Size
ar: الحجم

source: Category
ar: الفئة

source: Folder
ar: المجلد

source: Created
ar: تاريخ الإنشاء

source: Identifier
ar: المعرّف

source: Import from Photos
ar: استيراد من الصور

source: Import Document
ar: استيراد مستند

source: Add
ar: إضافة

source: Delete original photo?
ar: حذف الصورة الأصلية؟

source: Delete original photos?
ar: حذف الصور الأصلية؟

source: You can remove the original photo from your library after importing it.
ar: يمكنك حذف الصورة الأصلية من مكتبتك بعد الاستيراد.

source: Keep
ar: إبقاء

source: Recovery
ar: الاسترداد

source: Folder exists
ar: المجلد موجود

source: A folder with the same name already exists.
ar: يوجد مجلد بنفس الاسم بالفعل.

source: File exists
ar: الملف موجود

source: A file with the same name already exists in this folder. Replace it?
ar: يوجد ملف بنفس الاسم في هذا المجلد. هل تريد الاستبدال؟

source: Replace
ar: استبدال

source: OK
ar: حسناً

source: All Files
ar: كل الملفات

source: Delete folder?
ar: حذف المجلد؟

source: This action cannot be undone.
ar: لا يمكن التراجع عن هذا الإجراء.

source: This folder will be removed.
ar: سيتم حذف هذا المجلد.

source: Save to Files
ar: حفظ في الملفات

source: This folder and its contents will be removed.
ar: سيتم حذف هذا المجلد ومحتوياته.

source: Home
ar: الرئيسية

source: Recents
ar: موخراً

source: Filter
ar: التصفية

source: No Files
ar: لا توجد ملفات

source: Import to get started.
ar: ابدأ بالاستيراد.

source: Your vault is empty
ar: المخزن فارغ

source: Import files to begin securing your private storage.
ar: قم باستيراد الملفات لبدء تأمين مخزنك الخاص.

source: Secure Vault
ar: مخزن آمن

source: All content is encrypted on your device.
ar: جميع المحتويات مشفرة على جهازك.

source: Your Private Vault
ar: مخزنك الخاص

source: Import in Seconds
ar: استيراد خلال ثوانٍ

source: Organize with Folders
ar: تنظيم بالمجلدات

source: All files are encrypted locally and protected by Face ID or your device passcode.
ar: جميع الملفات مشفرة محليًا ومحميّة عبر Face ID أو رمز قفل الجهاز.

source: Bring photos, videos, and documents into your vault with one tap.
ar: أدخل الصور والفيديوهات والمستندات إلى مخزنك بضغطة واحدة.

source: Create folders and move items to keep everything in order.
ar: أنشئ مجلدات وانقل العناصر للحفاظ على الترتيب.

source: All files are encrypted locally and protected by Face ID and your app passcode.
ar: جميع الملفات مشفرة محليًا ومحميّة عبر Face ID ورمز مرور التطبيق.

source: Get Started
ar: ابدأ

source: Set App Passcode
ar: تعيين رمز مرور للتطبيق

source: Use this passcode to recover access if you cannot use Face ID.
ar: استخدم هذا الرمز لاستعادة الدخول إذا تعذر استخدام Face ID.

source: Passcode saved.
ar: تم حفظ رمز المرور.

source: Failed to save passcode.
ar: فشل حفظ رمز المرور.

source: App Passcode
ar: رمز مرور التطبيق

source: Unlock with Passcode
ar: فتح برمز المرور

source: Incorrect passcode.
ar: رمز المرور غير صحيح.

source: Set Passcode
ar: تعيين رمز المرور

source: Change Passcode
ar: تغيير رمز المرور

source: Recover access if biometrics fail
ar: استعادة الدخول عند تعذر البصمة

source: Unlock with biometrics
ar: فتح بالبصمة

source: Privacy
ar: الخصوصية

source: Appearance
ar: المظهر

source: Notifications
ar: الإشعارات

source: Data
ar: البيانات

source: App Theme
ar: مظهر التطبيق

source: System, Light, or Dark
ar: النظام أو فاتح أو داكن

source: System
ar: النظام

source: Light
ar: فاتح

source: Dark
ar: داكن

source: View More
ar: عرض المزيد

source: Full storage dashboard
ar: لوحة التخزين الكاملة

source: Erase All Data
ar: مسح جميع البيانات

source: Erase all data?
ar: مسح جميع البيانات؟

source: Erase
ar: مسح

source: This will delete all vault files and the app passcode. You will need to set a new passcode.
ar: سيتم حذف جميع ملفات المخزن ورمز المرور. ستحتاج لتعيين رمز جديد.

source: Vault Storage
ar: تخزين المخزن

source: Current Passcode
ar: رمز المرور الحالي

source: New Passcode
ar: رمز المرور الجديد

source: Confirm Passcode
ar: تأكيد رمز المرور

source: Save
ar: حفظ

source: Saving...
ar: جارٍ الحفظ...

source: Duplicates found
ar: تم العثور على تكرارات

source: Duplicate files detected (%d).
ar: تم اكتشاف %d ملف/ملفات مكررة.

source: Replace All
ar: استبدال الكل

source: Keep Both
ar: الاحتفاظ بالنسختين

source: Skip All
ar: تخطي الكل

source: Delete selected items?
ar: حذف العناصر المحددة؟

source: You are about to delete %d item(s).
ar: أنت على وشك حذف %d عنصر/عناصر.

source: Archive
ar: أرشيف

source: Archive preview is not available. Use Share to open in Files.
ar: معاينة الأرشيف غير متاحة. استخدم المشاركة لفتحه في الملفات.

source: Select All
ar: تحديد الكل

source: Selected
ar: محددة

source: Clear
ar: مسح

source: Save Passcode
ar: حفظ رمز المرور

source: No recent items
ar: لا توجد عناصر حديثة

source: Open a file to see it here.
ar: افتح ملفًا ليظهر هنا.

source: Pinned
ar: المثبتة

source: Save Folder
ar: حفظ المجلد

source: Change the folder name before saving to Files.
ar: غيّر اسم المجلد قبل الحفظ في الملفات.

source: Enter Passcode
ar: أدخل رمز المرور

source: Passcodes don't match. Try again.
ar: رموز المرور غير متطابقة. حاول مرة أخرى.

source: Enter your current passcode
ar: أدخل رمز المرور الحالي

source: Enter a new 6-digit passcode
ar: أدخل رمز مرور جديد مكون من 6 أرقام

source: Confirm your new passcode
ar: أكد رمز المرور الجديد

source: Incorrect current passcode.
ar: رمز المرور الحالي غير صحيح.

source: Secure Your Files
ar: أمّن ملفاتك

source: All files are encrypted locally with AES-256. Your data stays private and secure.
ar: جميع الملفات مشفرة محليًا باستخدام AES-256. بياناتك تبقى خاصة وآمنة.

source: Create folders, move files, and keep everything organized. Swipe left or right to navigate.
ar: أنشئ مجلدات، انقل الملفات، واحتفظ بكل شيء منظمًا. اسحب يمينًا أو يسارًا للتنقل.

source: Import Files
ar: استيراد الملفات

source: Tap the + button to import photos, videos, or documents from your device.
ar: اضغط على زر + لاستيراد الصور أو الفيديوهات أو المستندات من جهازك.

source: Swipe Actions
ar: إجراءات السحب

source: Swipe left to pin files, swipe right to share or delete. Long press for more options.
ar: اسحب يسارًا لتثبيت الملفات، اسحب يمينًا للمشاركة أو الحذف. اضغط مطولاً لمزيد من الخيارات.

source: Close Media Viewer
ar: إغلاق عارض الوسائط

source: Swipe down on any media to close the viewer. Swipe left or right to browse between files.
ar: اسحب للأسفل على أي وسائط لإغلاق العارض. اسحب يمينًا أو يسارًا للتنقل بين الملفات.

source: Previous
ar: السابق

source: Next
ar: التالي

source: Help
ar: المساعدة

source: Show Tutorial
ar: عرض التعليمات

source: Learn how to use SilentStore
ar: تعلم كيفية استخدام SilentStore

source: Permission denied. Tap to enable.
ar: تم رفض الصلاحية. اضغط لتفعيلها.

source: Tap to enable biometric authentication
ar: اضغط لتفعيل المصادقة البيومترية

source: Enable Face ID / Touch ID to unlock your vault quickly and securely.
ar: فعّل Face ID / Touch ID لفتح مخزنك بسرعة وأمان.
